[{"Query":"What are the two main categories of public capital works projects mentioned in the manual?","Expected":"The two main categories of public capital works projects are Civil Engineering Works and Building Works. Civil engineering works include roads, tunnels, and bridges, typically designed by civil engineers. Building works include office buildings, schools, and hospitals, generally designed by architects."},{"Query":"What are Delay Events and Compensation Events in the context of the new public works contracts?","Expected":"Delay Events are events that are not at the contractor’s risk and, if they occur, entitle the contractor to an extension of time. Compensation Events similarly are not at the contractor’s risk and entitle the contractor to additional payment for the cost impact. These are explicitly listed in the contract schedule to minimize disputes and improve clarity."},{"Query":"What are the key structural components of the new Public Works Contracts?","Expected":"The structure includes: 1. Letter of Acceptance 2. Agreement 3. Contract Conditions (13 sections including management, payment, disputes, etc.) 4. The Schedule (Parts 1 and 2) 5. Works Requirements 6. Pricing Document 7. Works Proposals 8. Suite of Model Forms (e.g., tender, bonds, letters, appointments)."},{"Query":"What is the purpose of Programme Contingency in the new contracts?","Expected":"Programme Contingency is a specified delay period built into the contract schedule and sum to account for events entitling the contractor to extensions and compensation. It provides financial and scheduling buffer for such foreseeable risks and enhances cost predictability."},{"Query":"Under what circumstances can a Contracting Authority allocate the risk of unforeseeable ground conditions to the contractor?","Expected":"A Contracting Authority can allocate this risk if a thorough site investigation has been conducted, providing sufficient and accurate information in the tender documents. The aim is to allow contractors to assess and price the risk effectively. Otherwise, the risk should remain with the employer."}]