{"query":{"0":"What is the primary objective of the Capital Works Management Framework?","1":"Under the new Public Works Contracts, who is responsible for design in a Traditional Contract?","2":"Which of the following is NOT a key change introduced by the new Public Works Contracts?","3":"What is the purpose of Programme Contingency?","4":"In the new contracts, what replaces the role of nominated subcontractors?","5":"Which clause in the Schedule Part 1 allows the Employer to allocate risk for unforeseeable ground conditions?","6":"What is the default retention percentage specified in the Schedule Part 1?","7":"Under the Design and Build Contract, who is responsible for ensuring the Works are fit for purpose?","8":"Which of the following is a Compensation Event under the Traditional Contract?","9":"What is the maximum period for which the Contractor must maintain Professional Indemnity insurance after Substantial Completion?","10":"Which document defines the Contractor's daily delay costs for Compensation Events?","11":"What is the consequence if the Contractor fails to provide a revised programme upon request?","12":"Under which clause can the Employer reject the entire Works due to serious defects?","13":"What is the primary purpose of the Letter of Acceptance?","14":"Which of the following is NOT an Employer's Risk under Clause 3.1?","15":"What is the default appointing body for conciliation if none is specified in the Schedule?","16":"Under Clause 5.3, what must the Contractor ensure regarding workpersons' wages?","17":"Which clause allows the Employer to deduct estimated unpaid wages from the Contractor?","18":"What is the Contractor's obligation under Clause 7.8 if archaeological artefacts are found?","19":"Which clause governs the Contractor's responsibility for Site security?","20":"What is the primary purpose of the Works Requirements in a Design and Build Contract?","21":"Under Clause 4.5, when must the ER issue a Change Order?","22":"What is the time limit for the ER to object to a Contractor's submission under Clause 4.7?","23":"Which clause allows the Employer to terminate the Contract if the Starting Date does not occur?","24":"What is the Contractor's liability for design by Specialists?","25":"Which clause requires the Contractor to provide a Quality Assurance system?","26":"What is the Contractor's obligation under Clause 7.10 on completion?","27":"Under Clause 11.5, when must the ER issue the penultimate payment certificate?","28":"Which clause governs the Contractor's right to suspend work for non-payment?","29":"What is the primary purpose of the Pricing Document?","30":"Under Clause 3.7, when is Professional Indemnity insurance required?","31":"What is the Contractor's obligation under Clause 4.16 regarding confidentiality?","32":"Which clause allows the ER to extend the Defects Period?","33":"What is the Contractor's responsibility under Clause 8.1 in a Traditional Contract?","34":"Under Clause 10.8, which Price Variation option is the default?","35":"What is the Employer's entitlement under Clause 8.5.3 if the Contractor fails to rectify defects?","36":"Which clause governs the Contractor's obligation to provide collateral warranties?","37":"What is the purpose of the Defects Certificate?","38":"Under Clause 4.3, who appoints the Employer's Representative?","39":"Which clause governs the Contractor's right to claim for unforeseen utilities delays?","40":"What is the Contractor's obligation under Clause 7.7 regarding setting out?","41":"Under Clause 3.6, who is covered by the Contractor's Public Liability insurance?","42":"Which clause allows the ER to instruct the Contractor to search for defects?","43":"44. What is the Contractor's obligation under Clause 4.9 regarding the programme?","44":"Under Clause 11.2, what is the default percentage for valuing unfixed Works Items in interim payments?","45":"Which clause governs the Contractor's responsibility for existing property damage?","46":"What is the Contractor's obligation under Clause 4.14 regarding communications?","47":"Under Clause 12.6, what must the ER determine within 10 working days of termination?","48":"Which clause allows the Employer to require random checks on wage records?","49":"What is the primary purpose of the Agreement document?"},"expected":{"0":"To ensure cost certainty, value for money, and efficient project delivery","1":"The Employer's design team","2":"Mandatory use of nominated subcontractors","3":"To account for delays and costs arising from Compensation Events","4":"Specialists","5":"Section K, Item 19","6":"10%","7":"The Contractor","8":"Unforeseeable ground conditions (if allocated to the Employer)","9":"6 years","10":"Schedule Part 2, Section E","11":"Withholding of 15% of payments","12":"Clause 8.5.5","13":"To form a binding contract","14":"Contractor's negligence","15":"Chartered Institute of Arbitrators Irish Branch","16":"Wages are never more than a month in arrears","17":"Clause 5.3.6","18":"Preserve them and notify the Employer","19":"Clause 7.2","20":"To specify performance or output criteria","21":"When it is physically impossible to comply with the Works Requirements","22":"10 working days","23":"Clause 12.1.1","24":"Full liability as if the design were their own","25":"Clause 8.2","26":"To leave the Site in a proper condition","27":"Within 3 months of the final statement","28":"Clause 12.3","29":"To evaluate tenders and value change orders","30":"If specified in the Schedule Part 1D","31":"To protect commercially sensitive information for 5 years","32":"Clause 8.6.2","33":"Fitness for purpose of Works Items they select","34":"PV1 (Proven Cost Method)","35":"To have the work done by others at the Contractor's cost","36":"Clause 5.5","37":"To confirm all defects have been rectified","38":"The Employer","39":"Schedule Part 1K, Item 21","40":"To check information before setting out","41":"The Contractor and Employer as co-insured","42":"Clause 8.5","43":"To submit a detailed programme before the Starting Date","44":"90%","45":"Clause 3.8 (if stated in the Schedule)","46":"To interpret communications purposefully","47":"The termination value","48":"Clause 5.3.3A (if stated in the Schedule)","49":"To confirm the Contract Sum and parties"}}